<a href="https://colab.research.google.com/github/kamothowambugu/kamotho-week-3-I.P/blob/main/Moringa_Data_Science_Prep_W3_Independent_Project_2019_07_Fredrick_Kamotho_DataReport.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
import numpy as np

In [3]:
#load dataset from cells_geo_description
#
df1b = pd.read_excel('cells_geo_description.xlsx' , index_col=0,header=0)
df1b.head(5)

                    Description  Format
Column name
VILLES                     City  String
STATUS        In Service or not  String
LOCALISATION  in ABIDJAN or not  String
DECOUPZONE    Geographical Zone  String
ZONENAME           Name of Zone  String

In [4]:
df1b.columns

Index(['Description', 'Format'], dtype='object')

In [5]:
#load dataset from cells_geo
#
df2 = pd.read_csv  ('cells_geo.csv' , index_col=0, header=0,)
df2.head(5)

Empty DataFrame
Columns: []
Index: [0;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AGBANNEW;-4.00066666666667;5.36819444444444;LAGUNE;;fbb2e75af3;0bb492ef17, 1;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AGBANNEW;-4.00066666666667;5.36819444444444;LAGUNE;;1502501d78;0bb492ef17, 2;ADJAME;In Service;ABIDJAN;"""Abidjan_EST";AGBANNEW;-4.00066666666667;5.36819444444444;LAGUNE;;0c2e182a0c;0bb492ef17, 3;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSINIE""";-3.48846666666667;5.15876111111111;SUD COMOE;;69bdfc69fd;8a1e6ce31f, 4;ASSINIE;In Service;INTERIEUR;Grand-EST;"ASSINIE""";-3.48846666666667;5.15876111111111;SUD COMOE;;7a1029d2ab;8a1e6ce31f]

In [6]:
df2.columns

Index([], dtype='object')

In [7]:
#load dataset from CDR_description
df = pd.read_excel('CDR_description.xlsx' , index_col=0,header=0)
df.head(10)

                                                       Description   Format
Column name
PRODUCT                                               Voice or SMS   String
VALUE                                                Billing price  Integer
DATE_TIME                     Time in format yyyy-MM-dd hh:mm:ss.0   String
CELL_ON_SITE     Which cell in the site was used (not needed here)  Integer
DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
COUNTRY_A                        Country of party A (useless here)   String
COUNTRY_B                        Country of party B (useless here)   String
CELL_ID                                             ID of the cell   String
SITE_ID                                             ID of the SITE   String

In [8]:
#

In [9]:
#loading the Telecom_dataset1.csv
df1 = pd.read_csv ('http://bit.ly/Telcom_dataset1' ,encoding='utf-8' )
df1.head(5)
#

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [10]:
#rename df1 column
#
df1.columns

Index(['PRODUTC', 'VALUE', 'DATETIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [11]:
df1.rename(columns={'PRODUTC':'PRODUCT','DATETIME':'DATE_TIME'},inplace=True)
df1.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [12]:
df1.shape

(5001, 10)

In [13]:
df1i = df1[['PRODUCT','VALUE','CELL_ON_SITE','DATE_TIME']]
df1i.head()

  PRODUCT  VALUE CELL_ON_SITE              DATE_TIME
0   Voice      0            1  2012-05-06 23:04:37.0
1     sms      0            0  2012-05-06 23:05:25.0
2     sms     25            0  2012-05-06 23:05:41.0
3   Voice     56            1  2012-05-06 23:05:42.0
4   Voice     14            1  2012-05-06 23:06:29.0

In [14]:
#loading the Telecom_dataset2.csv
df2a = pd.read_csv('http://bit.ly/Telcom_dataset2' ,encoding = 'utf-8')
df2a.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [15]:
df2a.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER',
       'DW_B_NUMBER', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [16]:
#renaming df2a columns
df2a.rename(columns={'DW_A_NUMBER':'DW_A_NUMBER_INT','DW_B_NUMBER':'DW_B_NUMBER_INT'}, inplace=True)
df2a.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [17]:
df2a.shape

(5001, 10)

In [18]:
df2ai = df2a[['PRODUCT','VALUE','CELL_ON_SITE','DATE_TIME']]
df2ai.head()

  PRODUCT  VALUE CELL_ON_SITE              DATE_TIME
0     sms      0            2  2012-05-07 23:02:06.0
1   Voice      0            1  2012-05-07 23:03:44.0
2     sms      0            0  2012-05-07 23:04:06.0
3   Voice     37            1  2012-05-07 23:04:48.0
4     sms     25            1  2012-05-07 23:04:58.0

In [19]:
#loading the Telecom_dataset3.csv
df3 = pd.read_csv ('http://bit.ly/Telcom_dataset3' ,encoding='utf-8')
df3.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [20]:
df3.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELLID', 'SIET_ID'],
      dtype='object')

In [21]:
#renaming df3 columns
df3.rename(columns={'CELLID':'CELL_ID','SIET_ID':'SITE_ID'}, inplace=True)
df3.columns

Index(['PRODUCT', 'VALUE', 'DATE_TIME', 'CELL_ON_SITE', 'DW_A_NUMBER_INT',
       'DW_B_NUMBER_INT', 'COUNTRY_A', 'COUNTRY_B', 'CELL_ID', 'SITE_ID'],
      dtype='object')

In [22]:
df3.shape

(5001, 10)

In [23]:
df3i = df3[['PRODUCT','VALUE','CELL_ON_SITE','DATE_TIME']]
df3i.head()

  PRODUCT  VALUE CELL_ON_SITE              DATE_TIME
0   Voice     61            2  2012-05-08 23:01:28.0
1     sms      0            1  2012-05-08 23:01:31.0
2   Voice     10            1  2012-05-08 23:02:59.0
3     sms      0            0  2012-05-08 23:03:04.0
4   Voice     22            4  2012-05-08 23:03:16.0

In [24]:
total_df = [df1i,df2ai,df3i]

In [25]:
results = pd.concat(total_df)
results

     PRODUCT  VALUE CELL_ON_SITE              DATE_TIME
0      Voice      0            1  2012-05-06 23:04:37.0
1        sms      0            0  2012-05-06 23:05:25.0
2        sms     25            0  2012-05-06 23:05:41.0
3      Voice     56            1  2012-05-06 23:05:42.0
4      Voice     14            1  2012-05-06 23:06:29.0
...      ...    ...          ...                    ...
4996   Voice      0            3  2012-05-09 00:01:43.0
4997   Voice     62            1  2012-05-09 00:01:43.0
4998   Voice     32            1  2012-05-09 00:01:43.0
4999   Voice     30            2  2012-05-09 00:01:43.0
5000   Voice     60            2  2012-05-09 00:01:43.0

[15003 rows x 4 columns]